# apply 메서드 활요
* apply 메서드는 사용자가 작성한 함수를 한 번에 데이터프레임의 각 행과 열에 적용하여 실핼할 수 있게 해주는 메서드이다.

## 제곱 함수와 n 제곱 함수 만들기

In [19]:
def my_sq(x):
    return x ** 2

In [20]:
3 ** 2

9

In [21]:
def my_exp(x, n):
    return x ** n

In [22]:
print(my_sq(4))

16

In [23]:
print(my_exp(3, 5))

243

## 시리즈와 데이터프레임에 apply 메서드 사용하기
### 1. 시리즈와 apply 메서드

In [32]:
import pandas as pd

df = pd.DataFrame({'a' : [10, 20, 30], 'b' : [20, 30, 40]})

df

    a   b
0  10  20
1  20  30
2  30  40

In [33]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [34]:
df['new1'] = df['a'].apply(my_sq)
df

    a   b  new1
0  10  20   100
1  20  30   400
2  30  40   900

In [40]:
df['new2'] = df['a'].apply(my_exp, n=2)
df

    a   b  new1  new2
0  10  20   100   100
1  20  30   400   400
2  30  40   900   900

In [37]:
df['new2'] = df['a'].apply(my_exp, n=3)
df

    a   b  new1   new2
0  10  20   100   1000
1  20  30   400   8000
2  30  40   900  27000

### 5. 데이터 프레임과 apply 메서드

In [29]:
df = pd.DataFrame({'a' : [10, 20, 30], 'b': [20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [30]:
def print_me(x):
    print(x)

In [38]:
# axis = 0 (행 방향, 높이)
# axis = 1 (열 방향, 폭)
df.apply(print_me, axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
0    100
1    400
2    900
Name: new1, dtype: int64
0     1000
1     8000
2    27000
Name: new2, dtype: int64

a       None
b       None
new1    None
new2    None
dtype: object

In [39]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [41]:
def avg_3(x, y, z):
    return (x + y +z) / 3

In [43]:
print(df.apply(avg_3))

TypeError: ("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index a')

In [44]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y +z) / 3

print(df.apply(avg_3_apply))
# a 20.0 (10+20+30/3)
# b 30.0 (20+30+40/3)

a        20.000000
b        30.000000
new1    466.666667
new2    466.666667
dtype: float64

In [45]:
def avg_3_apply(col):
    sum = 0
    for item in col:
        sum += item
    return sum / df.shape[0]

In [48]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
        print(sum)
    return sum / df.shape[1]

In [49]:
df['average'] = df.apply(avg_2_apply, axis = 1)
df

10.0
30.0
130.0
230.0
287.5
20.0
50.0
450.0
850.0
1062.5
30.0
70.0
970.0
1870.0
2337.5

    a   b  new1  new2  average
0  10  20   100   100     57.5
1  20  30   400   400    212.5
2  30  40   900   900    467.5

## 데이터 프레임의 누락값을 처리한 다음 apply 메서드 사용하기
### 1. 데이터프레임의 누락값 처리하기 -- 열방향

In [66]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

In [67]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [80]:
# count_missing 누락값의 갯수
import numpy as np

def count_missing(vec):
    null_vec = pd.isnull(vec)
    # print(null_vec)
    null_count = np.sum(null_vec)
    return null_count

In [81]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [82]:
cimis_col = titanic.apply(count_missing)
print(cimis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [92]:
# prop_missing 누락값의 비율을 계산
# count_missing 함수를 이용 누락값의 개수를 구하고 size 속성을 이용하여 df의 전체 데이터 수를 구하여 나눔
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    # print('누락값의 갯수(num) -> %d, 전체 데이터 수(dem)->%d'%(num,dem))
    return num / dem

In [94]:
pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [98]:
# 누락값이 아닌 데이터 비율을 구함
# 전체(1) - 누락값의 비율
def prop_complete(vec):
    return 1 - prop_missing(vec)

### 8. 데이터 프레임의 누락값을 처리하기 -- 행방향

In [99]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

print(cmis_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [100]:
print(pmis_row.head())

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [101]:
print(pcom_row.head())

0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [102]:
# 누락값의 개수를 구하여 df에 추가
# num_missing열이 추가됨
titanic['num_missing'] = titanic.apply(count_missing, axis = 1)
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [103]:
# 누락값이 2개 이상인 데이터만 추출
titanic.loc[titanic.num_missing > 1, :].sample(10) # 랜덤하게 10개 추출

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
531,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
368,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,2
158,0,3,male,NaN,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,2
832,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
241,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,2
650,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2